
# State **`s3://infrahouse-aws-control-493370826424/terraform.tfstate`**
## Affected resources counts

|  Success  |   🟢 Add |   🟡 Change |    Destroy |
|:---------:|--------:|-----------:|-----------:|
|     ✅     |      26 |          1 |          0 |
## Affected resources by action

|  Action  | Resources                                                                                         |
|:--------:|:--------------------------------------------------------------------------------------------------|
|    🟢     | `module.mail_twindb_com.aws_autoscaling_group.postfix`                                            |
|    🟢     | `module.mail_twindb_com.aws_efs_file_system.mail`                                                 |
|    🟢     | `module.mail_twindb_com.aws_efs_mount_target.mail["subnet-06caf71c8b0afd909"]`                    |
|    🟢     | `module.mail_twindb_com.aws_efs_mount_target.mail["subnet-0f91dd2675e7a16c3"]`                    |
|    🟢     | `module.mail_twindb_com.aws_iam_policy.required`                                                  |
|    🟢     | `module.mail_twindb_com.aws_launch_template.postfix`                                              |
|    🟢     | `module.mail_twindb_com.aws_lb.postfix`                                                           |
|    🟢     | `module.mail_twindb_com.aws_lb_listener.postfix`                                                  |
|    🟢     | `module.mail_twindb_com.aws_lb_target_group.postfix`                                              |
|    🟢     | `module.mail_twindb_com.aws_route53_record.postfix_cname`                                         |
|    🟢     | `module.mail_twindb_com.aws_security_group.efs`                                                   |
|    🟢     | `module.mail_twindb_com.aws_security_group.postfix`                                               |
|    🟢     | `module.mail_twindb_com.aws_vpc_security_group_egress_rule.default`                               |
|    🟢     | `module.mail_twindb_com.aws_vpc_security_group_egress_rule.efs`                                   |
|    🟢     | `module.mail_twindb_com.aws_vpc_security_group_ingress_rule.efs`                                  |
|    🟢     | `module.mail_twindb_com.aws_vpc_security_group_ingress_rule.efs_icmp`                             |
|    🟢     | `module.mail_twindb_com.aws_vpc_security_group_ingress_rule.icmp`                                 |
|    🟢     | `module.mail_twindb_com.aws_vpc_security_group_ingress_rule.smtp`                                 |
|    🟢     | `module.mail_twindb_com.aws_vpc_security_group_ingress_rule.ssh`                                  |
|    🟢     | `module.mail_twindb_com.random_string.asg_name`                                                   |
|    🟢     | `module.mail_twindb_com.random_string.profile-suffix`                                             |
|    🟢     | `module.mail_twindb_com.module.instance-profile.aws_iam_instance_profile.profile`                 |
|    🟢     | `module.mail_twindb_com.module.instance-profile.aws_iam_policy.profile`                           |
|    🟢     | `module.mail_twindb_com.module.instance-profile.aws_iam_role.profile`                             |
|    🟢     | `module.mail_twindb_com.module.instance-profile.aws_iam_role_policy_attachment.extra["required"]` |
|    🟢     | `module.mail_twindb_com.module.instance-profile.aws_iam_role_policy_attachment.profile`           |
|    🟡     | `aws_route53_record.mx_twindb_com`                                                                |
<details>
<summary>STDOUT</summary>

```
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place
 <= read (data resources)

Terraform will perform the following actions:

  # aws_route53_record.mx_twindb_com will be updated in-place
  ~ resource "aws_route53_record" "mx_twindb_com" {
        id                               = "Z09416683EO4N1FTX4GYF_twindb.com_MX"
        name                             = "twindb.com"
      ~ ttl                              = 300 -> 3600
        # (5 unchanged attributes hidden)
    }

  # module.mail_twindb_com.data.aws_iam_policy_document.required_permissions will be read during apply
  # (config refers to values not yet known)
 <= data "aws_iam_policy_document" "required_permissions" {
      + id   = (known after apply)
      + json = (known after apply)

      + statement {
          + actions   = [
              + "autoscaling:DescribeAutoScalingInstances",
            ]
          + resources = [
              + (known after apply),
            ]
        }
    }

  # module.mail_twindb_com.aws_autoscaling_group.postfix will be created
  + resource "aws_autoscaling_group" "postfix" {
      + arn                              = (known after apply)
      + availability_zones               = (known after apply)
      + default_cooldown                 = (known after apply)
      + desired_capacity                 = (known after apply)
      + force_delete                     = false
      + force_delete_warm_pool           = false
      + health_check_grace_period        = 300
      + health_check_type                = (known after apply)
      + id                               = (known after apply)
      + ignore_failed_scaling_activities = false
      + load_balancers                   = (known after apply)
      + max_instance_lifetime            = 7776000
      + max_size                         = 1
      + metrics_granularity              = "1Minute"
      + min_size                         = 1
      + name                             = (known after apply)
      + name_prefix                      = (known after apply)
      + predicted_capacity               = (known after apply)
      + protect_from_scale_in            = false
      + service_linked_role_arn          = (known after apply)
      + target_group_arns                = (known after apply)
      + vpc_zone_identifier              = [
          + "subnet-06caf71c8b0afd909",
          + "subnet-0f91dd2675e7a16c3",
        ]
      + wait_for_capacity_timeout        = "10m"
      + warm_pool_size                   = (known after apply)

      + instance_refresh {
          + strategy = "Rolling"

          + preferences {
              + max_healthy_percentage       = 100
              + min_healthy_percentage       = 100
              + scale_in_protected_instances = "Ignore"
              + skip_matching                = false
              + standby_instances            = "Ignore"
            }
        }

      + launch_template {
          + id      = (known after apply)
          + name    = (known after apply)
          + version = (known after apply)
        }

      + tag {
          + key                 = "Name"
          + propagate_at_launch = true
          + value               = "mail"
        }
      + tag {
          + key                 = "created_by_module"
          + propagate_at_launch = true
          + value               = "infrahouse/postfix/aws"
        }
    }

  # module.mail_twindb_com.aws_efs_file_system.mail will be created
  + resource "aws_efs_file_system" "mail" {
      + arn                     = (known after apply)
      + availability_zone_id    = (known after apply)
      + availability_zone_name  = (known after apply)
      + creation_token          = "mail-storage"
      + dns_name                = (known after apply)
      + encrypted               = (known after apply)
      + id                      = (known after apply)
      + kms_key_id              = (known after apply)
      + name                    = (known after apply)
      + number_of_mount_targets = (known after apply)
      + owner_id                = (known after apply)
      + performance_mode        = (known after apply)
      + size_in_bytes           = (known after apply)
      + tags                    = {
          + "Name"              = "mail"
          + "created_by_module" = "infrahouse/postfix/aws"
        }
      + tags_all                = {
          + "Name"              = "mail"
          + "created_by"        = "infrahouse/aws-control-493370826424"
          + "created_by_module" = "infrahouse/postfix/aws"
          + "environment"       = "production"
        }
      + throughput_mode         = "bursting"
    }

  # module.mail_twindb_com.aws_efs_mount_target.mail["subnet-06caf71c8b0afd909"] will be created
  + resource "aws_efs_mount_target" "mail" {
      + availability_zone_id   = (known after apply)
      + availability_zone_name = (known after apply)
      + dns_name               = (known after apply)
      + file_system_arn        = (known after apply)
      + file_system_id         = (known after apply)
      + id                     = (known after apply)
      + ip_address             = (known after apply)
      + mount_target_dns_name  = (known after apply)
      + network_interface_id   = (known after apply)
      + owner_id               = (known after apply)
      + security_groups        = (known after apply)
      + subnet_id              = "subnet-06caf71c8b0afd909"
    }

  # module.mail_twindb_com.aws_efs_mount_target.mail["subnet-0f91dd2675e7a16c3"] will be created
  + resource "aws_efs_mount_target" "mail" {
      + availability_zone_id   = (known after apply)
      + availability_zone_name = (known after apply)
      + dns_name               = (known after apply)
      + file_system_arn        = (known after apply)
      + file_system_id         = (known after apply)
      + id                     = (known after apply)
      + ip_address             = (known after apply)
      + mount_target_dns_name  = (known after apply)
      + network_interface_id   = (known after apply)
      + owner_id               = (known after apply)
      + security_groups        = (known after apply)
      + subnet_id              = "subnet-0f91dd2675e7a16c3"
    }

  # module.mail_twindb_com.aws_iam_policy.required will be created
  + resource "aws_iam_policy" "required" {
      + arn         = (known after apply)
      + id          = (known after apply)
      + name        = (known after apply)
      + name_prefix = (known after apply)
      + path        = "/"
      + policy      = (known after apply)
      + policy_id   = (known after apply)
      + tags_all    = {
          + "created_by"  = "infrahouse/aws-control-493370826424"
          + "environment" = "production"
        }
    }

  # module.mail_twindb_com.aws_launch_template.postfix will be created
  + resource "aws_launch_template" "postfix" {
      + arn                    = (known after apply)
      + default_version        = (known after apply)
      + id                     = (known after apply)
      + image_id               = "ami-082ebbea44fc7abcd"
      + instance_type          = "t3a.micro"
      + key_name               = "aleks"
      + latest_version         = (known after apply)
      + name                   = (known after apply)
      + name_prefix            = "postfix-"
      + tags                   = {
          + "created_by_module" = "infrahouse/postfix/aws"
        }
      + tags_all               = {
          + "created_by"        = "infrahouse/aws-control-493370826424"
          + "created_by_module" = "infrahouse/postfix/aws"
          + "environment"       = "production"
        }
      + user_data              = (known after apply)
      + vpc_security_group_ids = (known after apply)

      + iam_instance_profile {
          + arn = (known after apply)
        }
    }

  # module.mail_twindb_com.aws_lb.postfix will be created
  + resource "aws_lb" "postfix" {
      + arn                                                          = (known after apply)
      + arn_suffix                                                   = (known after apply)
      + dns_name                                                     = (known after apply)
      + dns_record_client_routing_policy                             = "any_availability_zone"
      + enable_cross_zone_load_balancing                             = true
      + enable_deletion_protection                                   = false
      + enforce_security_group_inbound_rules_on_private_link_traffic = (known after apply)
      + id                                                           = (known after apply)
      + internal                                                     = (known after apply)
      + ip_address_type                                              = (known after apply)
      + load_balancer_type                                           = "network"
      + name                                                         = (known after apply)
      + name_prefix                                                  = "postfi"
      + security_groups                                              = (known after apply)
      + subnets                                                      = [
          + "subnet-04b8845d896c6ebde",
          + "subnet-0df885dcc99418799",
        ]
      + tags                                                         = {
          + "created_by_module" = "infrahouse/postfix/aws"
        }
      + tags_all                                                     = {
          + "created_by"        = "infrahouse/aws-control-493370826424"
          + "created_by_module" = "infrahouse/postfix/aws"
          + "environment"       = "production"
        }
      + vpc_id                                                       = (known after apply)
      + zone_id                                                      = (known after apply)
    }

  # module.mail_twindb_com.aws_lb_listener.postfix will be created
  + resource "aws_lb_listener" "postfix" {
      + arn               = (known after apply)
      + id                = (known after apply)
      + load_balancer_arn = (known after apply)
      + port              = 25
      + protocol          = "TCP"
      + ssl_policy        = (known after apply)
      + tags_all          = {
          + "created_by"  = "infrahouse/aws-control-493370826424"
          + "environment" = "production"
        }

      + default_action {
          + order            = (known after apply)
          + target_group_arn = (known after apply)
          + type             = "forward"
        }
    }

  # module.mail_twindb_com.aws_lb_target_group.postfix will be created
  + resource "aws_lb_target_group" "postfix" {
      + arn                                = (known after apply)
      + arn_suffix                         = (known after apply)
      + connection_termination             = (known after apply)
      + deregistration_delay               = "300"
      + id                                 = (known after apply)
      + ip_address_type                    = (known after apply)
      + lambda_multi_value_headers_enabled = false
      + load_balancer_arns                 = (known after apply)
      + load_balancing_algorithm_type      = (known after apply)
      + load_balancing_anomaly_mitigation  = (known after apply)
      + load_balancing_cross_zone_enabled  = (known after apply)
      + name                               = (known after apply)
      + name_prefix                        = "postfi"
      + port                               = 25
      + preserve_client_ip                 = (known after apply)
      + protocol                           = "TCP"
      + protocol_version                   = (known after apply)
      + proxy_protocol_v2                  = false
      + slow_start                         = 0
      + tags                               = {
          + "created_by_module" = "infrahouse/postfix/aws"
        }
      + tags_all                           = {
          + "created_by"        = "infrahouse/aws-control-493370826424"
          + "created_by_module" = "infrahouse/postfix/aws"
          + "environment"       = "production"
        }
      + target_type                        = "instance"
      + vpc_id                             = "vpc-08e19d859c26d18b2"

      + stickiness {
          + enabled = true
          + type    = "source_ip"
        }
    }

  # module.mail_twindb_com.aws_route53_record.postfix_cname will be created
  + resource "aws_route53_record" "postfix_cname" {
      + allow_overwrite = (known after apply)
      + fqdn            = (known after apply)
      + id              = (known after apply)
      + name            = "mail.twindb.com"
      + records         = (known after apply)
      + ttl             = 300
      + type            = "CNAME"
      + zone_id         = "Z09416683EO4N1FTX4GYF"
    }

  # module.mail_twindb_com.aws_security_group.efs will be created
  + resource "aws_security_group" "efs" {
      + arn                    = (known after apply)
      + description            = "Security group for mail EFS volume"
      + egress                 = (known after apply)
      + id                     = (known after apply)
      + ingress                = (known after apply)
      + name                   = (known after apply)
      + name_prefix            = "mail-efs-"
      + owner_id               = (known after apply)
      + revoke_rules_on_delete = false
      + tags                   = {
          + "Name"              = "EFS mail storage"
          + "created_by_module" = "infrahouse/postfix/aws"
        }
      + tags_all               = {
          + "Name"              = "EFS mail storage"
          + "created_by"        = "infrahouse/aws-control-493370826424"
          + "created_by_module" = "infrahouse/postfix/aws"
          + "environment"       = "production"
        }
      + vpc_id                 = "vpc-08e19d859c26d18b2"
    }

  # module.mail_twindb_com.aws_security_group.postfix will be created
  + resource "aws_security_group" "postfix" {
      + arn                    = (known after apply)
      + description            = "Manage traffic to postfix"
      + egress                 = (known after apply)
      + id                     = (known after apply)
      + ingress                = (known after apply)
      + name                   = (known after apply)
      + name_prefix            = "postfix"
      + owner_id               = (known after apply)
      + revoke_rules_on_delete = false
      + tags                   = {
          + "Name"              = "postfix"
          + "created_by_module" = "infrahouse/postfix/aws"
        }
      + tags_all               = {
          + "Name"              = "postfix"
          + "created_by"        = "infrahouse/aws-control-493370826424"
          + "created_by_module" = "infrahouse/postfix/aws"
          + "environment"       = "production"
        }
      + vpc_id                 = "vpc-08e19d859c26d18b2"
    }

  # module.mail_twindb_com.aws_vpc_security_group_egress_rule.default will be created
  + resource "aws_vpc_security_group_egress_rule" "default" {
      + arn                    = (known after apply)
      + cidr_ipv4              = "0.0.0.0/0"
      + description            = "Allow all traffic"
      + id                     = (known after apply)
      + ip_protocol            = "-1"
      + security_group_id      = (known after apply)
      + security_group_rule_id = (known after apply)
      + tags                   = {
          + "Name"              = "outgoing traffic"
          + "created_by_module" = "infrahouse/postfix/aws"
        }
      + tags_all               = {
          + "Name"              = "outgoing traffic"
          + "created_by"        = "infrahouse/aws-control-493370826424"
          + "created_by_module" = "infrahouse/postfix/aws"
          + "environment"       = "production"
        }
    }

  # module.mail_twindb_com.aws_vpc_security_group_egress_rule.efs will be created
  + resource "aws_vpc_security_group_egress_rule" "efs" {
      + arn                    = (known after apply)
      + cidr_ipv4              = "0.0.0.0/0"
      + id                     = (known after apply)
      + ip_protocol            = "-1"
      + security_group_id      = (known after apply)
      + security_group_rule_id = (known after apply)
      + tags                   = {
          + "Name"              = "EFS outgoing traffic"
          + "created_by_module" = "infrahouse/postfix/aws"
        }
      + tags_all               = {
          + "Name"              = "EFS outgoing traffic"
          + "created_by"        = "infrahouse/aws-control-493370826424"
          + "created_by_module" = "infrahouse/postfix/aws"
          + "environment"       = "production"
        }
    }

  # module.mail_twindb_com.aws_vpc_security_group_ingress_rule.efs will be created
  + resource "aws_vpc_security_group_ingress_rule" "efs" {
      + arn                    = (known after apply)
      + cidr_ipv4              = "10.0.0.0/22"
      + description            = "Allow NFS traffic to EFS volume"
      + from_port              = 2049
      + id                     = (known after apply)
      + ip_protocol            = "tcp"
      + security_group_id      = (known after apply)
      + security_group_rule_id = (known after apply)
      + tags                   = {
          + "Name"              = "NFS traffic"
          + "created_by_module" = "infrahouse/postfix/aws"
        }
      + tags_all               = {
          + "Name"              = "NFS traffic"
          + "created_by"        = "infrahouse/aws-control-493370826424"
          + "created_by_module" = "infrahouse/postfix/aws"
          + "environment"       = "production"
        }
      + to_port                = 2049
    }

  # module.mail_twindb_com.aws_vpc_security_group_ingress_rule.efs_icmp will be created
  + resource "aws_vpc_security_group_ingress_rule" "efs_icmp" {
      + arn                    = (known after apply)
      + cidr_ipv4              = "0.0.0.0/0"
      + description            = "Allow all ICMP traffic"
      + from_port              = -1
      + id                     = (known after apply)
      + ip_protocol            = "icmp"
      + security_group_id      = (known after apply)
      + security_group_rule_id = (known after apply)
      + tags                   = {
          + "Name"              = "ICMP traffic"
          + "created_by_module" = "infrahouse/postfix/aws"
        }
      + tags_all               = {
          + "Name"              = "ICMP traffic"
          + "created_by"        = "infrahouse/aws-control-493370826424"
          + "created_by_module" = "infrahouse/postfix/aws"
          + "environment"       = "production"
        }
      + to_port                = -1
    }

  # module.mail_twindb_com.aws_vpc_security_group_ingress_rule.icmp will be created
  + resource "aws_vpc_security_group_ingress_rule" "icmp" {
      + arn                    = (known after apply)
      + cidr_ipv4              = "0.0.0.0/0"
      + description            = "Allow all ICMP traffic"
      + from_port              = -1
      + id                     = (known after apply)
      + ip_protocol            = "icmp"
      + security_group_id      = (known after apply)
      + security_group_rule_id = (known after apply)
      + tags                   = {
          + "Name"              = "ICMP traffic"
          + "created_by_module" = "infrahouse/postfix/aws"
        }
      + tags_all               = {
          + "Name"              = "ICMP traffic"
          + "created_by"        = "infrahouse/aws-control-493370826424"
          + "created_by_module" = "infrahouse/postfix/aws"
          + "environment"       = "production"
        }
      + to_port                = -1
    }

  # module.mail_twindb_com.aws_vpc_security_group_ingress_rule.smtp will be created
  + resource "aws_vpc_security_group_ingress_rule" "smtp" {
      + arn                    = (known after apply)
      + cidr_ipv4              = "0.0.0.0/0"
      + description            = "Allow SMTP traffic"
      + from_port              = 25
      + id                     = (known after apply)
      + ip_protocol            = "tcp"
      + security_group_id      = (known after apply)
      + security_group_rule_id = (known after apply)
      + tags                   = {
          + "Name"              = "SMTP access"
          + "created_by_module" = "infrahouse/postfix/aws"
        }
      + tags_all               = {
          + "Name"              = "SMTP access"
          + "created_by"        = "infrahouse/aws-control-493370826424"
          + "created_by_module" = "infrahouse/postfix/aws"
          + "environment"       = "production"
        }
      + to_port                = 25
    }

  # module.mail_twindb_com.aws_vpc_security_group_ingress_rule.ssh will be created
  + resource "aws_vpc_security_group_ingress_rule" "ssh" {
      + arn                    = (known after apply)
      + cidr_ipv4              = "10.0.0.0/22"
      + description            = "Allow SSH traffic"
      + from_port              = 22
      + id                     = (known after apply)
      + ip_protocol            = "tcp"
      + security_group_id      = (known after apply)
      + security_group_rule_id = (known after apply)
      + tags                   = {
          + "Name"              = "SSH access"
          + "created_by_module" = "infrahouse/postfix/aws"
        }
      + tags_all               = {
          + "Name"              = "SSH access"
          + "created_by"        = "infrahouse/aws-control-493370826424"
          + "created_by_module" = "infrahouse/postfix/aws"
          + "environment"       = "production"
        }
      + to_port                = 22
    }

  # module.mail_twindb_com.random_string.asg_name will be created
  + resource "random_string" "asg_name" {
      + id          = (known after apply)
      + length      = 6
      + lower       = true
      + min_lower   = 0
      + min_numeric = 0
      + min_special = 0
      + min_upper   = 0
      + number      = true
      + numeric     = true
      + result      = (known after apply)
      + special     = false
      + upper       = true
    }

  # module.mail_twindb_com.random_string.profile-suffix will be created
  + resource "random_string" "profile-suffix" {
      + id          = (known after apply)
      + length      = 12
      + lower       = true
      + min_lower   = 0
      + min_numeric = 0
      + min_special = 0
      + min_upper   = 0
      + number      = true
      + numeric     = true
      + result      = (known after apply)
      + special     = false
      + upper       = true
    }

  # module.mail_twindb_com.module.instance-profile.aws_iam_instance_profile.profile will be created
  + resource "aws_iam_instance_profile" "profile" {
      + arn         = (known after apply)
      + create_date = (known after apply)
      + id          = (known after apply)
      + name        = (known after apply)
      + name_prefix = (known after apply)
      + path        = "/"
      + role        = (known after apply)
      + tags        = {
          + "created_by_module" = "infrahouse/instance-profile/aws"
        }
      + tags_all    = {
          + "created_by"        = "infrahouse/aws-control-493370826424"
          + "created_by_module" = "infrahouse/instance-profile/aws"
          + "environment"       = "production"
        }
      + unique_id   = (known after apply)
    }

  # module.mail_twindb_com.module.instance-profile.aws_iam_policy.profile will be created
  + resource "aws_iam_policy" "profile" {
      + arn         = (known after apply)
      + id          = (known after apply)
      + name        = (known after apply)
      + name_prefix = (known after apply)
      + path        = "/"
      + policy      = jsonencode(
            {
              + Statement = [
                  + {
                      + Action   = "sts:GetCallerIdentity"
                      + Effect   = "Allow"
                      + Resource = "*"
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + policy_id   = (known after apply)
      + tags        = {
          + "created_by_module" = "infrahouse/instance-profile/aws"
        }
      + tags_all    = {
          + "created_by"        = "infrahouse/aws-control-493370826424"
          + "created_by_module" = "infrahouse/instance-profile/aws"
          + "environment"       = "production"
        }
    }

  # module.mail_twindb_com.module.instance-profile.aws_iam_role.profile will be created
  + resource "aws_iam_role" "profile" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRole"
                      + Effect    = "Allow"
                      + Principal = {
                          + Service = "ec2.amazonaws.com"
                        }
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + force_detach_policies = false
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = (known after apply)
      + name_prefix           = (known after apply)
      + path                  = "/"
      + tags                  = {
          + "created_by_module" = "infrahouse/instance-profile/aws"
        }
      + tags_all              = {
          + "created_by"        = "infrahouse/aws-control-493370826424"
          + "created_by_module" = "infrahouse/instance-profile/aws"
          + "environment"       = "production"
        }
      + unique_id             = (known after apply)
    }

  # module.mail_twindb_com.module.instance-profile.aws_iam_role_policy_attachment.extra["required"] will be created
  + resource "aws_iam_role_policy_attachment" "extra" {
      + id         = (known after apply)
      + policy_arn = (known after apply)
      + role       = (known after apply)
    }

  # module.mail_twindb_com.module.instance-profile.aws_iam_role_policy_attachment.profile will be created
  + resource "aws_iam_role_policy_attachment" "profile" {
      + id         = (known after apply)
      + policy_arn = (known after apply)
      + role       = (known after apply)
    }

  # module.mail_twindb_com.module.mta-userdata.data.cloudinit_config.config will be read during apply
  # (config refers to values not yet known)
 <= data "cloudinit_config" "config" {
      + base64_encode = true
      + boundary      = (known after apply)
      + gzip          = false
      + id            = (known after apply)
      + rendered      = (known after apply)

      + part {
          + content      = (known after apply)
          + content_type = "text/cloud-config"
        }
    }

Plan: 26 to add, 1 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: tf.plan

To perform exactly these actions, run the following command to apply:
    terraform apply "tf.plan"
```
</details>
<details><summary><i>metadata</i></summary>

```
eyJzMzovL2luZnJhaG91c2UtYXdzLWNvbnRyb2wtNDkzMzcwODI2NDI0L3RlcnJhZm9ybS50ZnN0YXRlIjogeyJzdWNjZXNzIjogdHJ1ZSwgImFkZCI6IDI2LCAiY2hhbmdlIjogMSwgImRlc3Ryb3kiOiAwfX0=
```
</details>